sapam/F16_ICP_Panel_BMS_Arduino/arduino/hardware/arduino/avr/boards.txt
## Arduino Mega w/ ATmega1280
## -------------------------
mega.menu.cpu.atmega1280=ATmega1280

mega.menu.cpu.atmega1280.upload.protocol=arduino
mega.menu.cpu.atmega1280.upload.maximum_size=126976
mega.menu.cpu.atmega1280.upload.speed=57600

mega.menu.cpu.atmega1280.bootloader.high_fuses=0xDA
mega.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
mega.menu.cpu.atmega1280.bootloader.file=atmega/ATmegaBOOT_168_atmega1280.hex

mega.menu.cpu.atmega1280.build.mcu=atmega1280
mega.menu.cpu.atmega1280.build.board=AVR_MEGA

##############################################################

megaADK.name=Arduino Mega ADK

megaADK.vid.0=0x2341
megaADK.pid.0=0x003f
megaADK.vid.1=0x2341
megaADK.pid.1=0x0044
megaADK.vid.2=0x2A03
megaADK.pid.2=0x003f
megaADK.vid.3=0x2A03
megaADK.pid.3=0x0044

megaADK.upload.tool=avrdude
megaADK.upload.protocol=wiring
megaADK.upload.maximum_size=253952
megaADK.upload.maximum_data_size=8192
megaADK.upload.speed=115200

megaADK.bootloader.tool=avrdude
megaADK.bootloader.low_fuses=0xFF
megaADK.bootloader.high_fuses=0xD8
megaADK.bootloader.extended_fuses=0xFD
megaADK.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex
megaADK.bootloader.unlock_bits=0x3F
megaADK.bootloader.lock_bits=0x0F

megaADK.build.mcu=atmega2560
megaADK.build.f_cpu=16000000L
megaADK.build.board=AVR_ADK
megaADK.build.core=arduino
megaADK.build.variant=mega

##############################################################

leonardo.name=Arduino Leonardo
leonardo.vid.0=0x2341
leonardo.pid.0=0x0036
leonardo.vid.1=0x2341
leonardo.pid.1=0x8036
leonardo.vid.2=0x2A03
leonardo.pid.2=0x0036
leonardo.vid.3=0x2A03
leonardo.pid.3=0x8036

leonardo.upload.tool=avrdude
leonardo.upload.protocol=avr109
leonardo.upload.maximum_size=28672
leonardo.upload.maximum_data_size=2560
leonardo.upload.speed=57600
leonardo.upload.disable_flushing=true
leonardo.upload.use_1200bps_touch=true
leonardo.upload.wait_for_upload_port=true

leonardo.bootloader.tool=avrdude
leonardo.bootloader.low_fuses=0xff
leonardo.bootloader.high_fuses=0xd8
leonardo.bootloader.extended_fuses=0xcb
leonardo.bootloader.file=caterina/Caterina-Leonardo.hex
leonardo.bootloader.unlock_bits=0x3F
leonardo.bootloader.lock_bits=0x2F

leonardo.build.mcu=atmega32u4
leonardo.build.f_cpu=16000000L
leonardo.build.vid=0x2341
leonardo.build.pid=0x8036
leonardo.build.usb_product="Arduino Leonardo"
leonardo.build.board=AVR_LEONARDO
leonardo.build.core=arduino
leonardo.build.variant=leonardo
leonardo.build.extra_flags={build.usb_flags}

##############################################################

f16icpld.name=F16 ICP Panel LD
f16icpld.vid.0=0x2341
f16icpld.pid.0=0x0036
f16icpld.vid.1=0x2341
f16icpld.pid.1=0x8036
f16icpld.vid.2=0x2A03
f16icpld.pid.2=0x0036
f16icpld.vid.3=0x2A03
f16icpld.pid.3=0x8036

f16icpld.upload.tool=avrdude
f16icpld.upload.protocol=avr109
f16icpld.upload.maximum_size=28672
f16icpld.upload.maximum_data_size=2560
f16icpld.upload.speed=57600
f16icpld.upload.disable_flushing=true
f16icpld.upload.use_1200bps_touch=true
f16icpld.upload.wait_for_upload_port=true

f16icpld.bootloader.tool=avrdude
f16icpld.bootloader.low_fuses=0xff
f16icpld.bootloader.high_fuses=0xd8
f16icpld.bootloader.extended_fuses=0xcb
f16icpld.bootloader.file=caterina/Caterina-Leonardo.hex
f16icpld.bootloader.unlock_bits=0x3F
f16icpld.bootloader.lock_bits=0x2F

f16icpld.build.mcu=atmega32u4
f16icpld.build.f_cpu=16000000L
f16icpld.build.vid=0x2341
f16icpld.build.pid=0x9902
f16icpld.build.usb_product="F16 ICP Panel LD"
f16icpld.build.board=AVR_LEONARDO
f16icpld.build.core=arduino
f16icpld.build.variant=leonardo
f16icpld.build.extra_flags={build.usb_flags}

##############################################################

f16icpld.name=F16 HOTAS Extension LD
f16icpld.vid.0=0x2341
f16icpld.pid.0=0x0036
f16icpld.vid.1=0x2341
f16icpld.pid.1=0x8036
f16icpld.vid.2=0x2A03
f16icpld.pid.2=0x0036
f16icpld.vid.3=0x2A03
f16icpld.pid.3=0x8036

f16icpld.upload.tool=avrdude
f16icpld.upload.protocol=avr109
f16icpld.upload.maximum_size=28672
f16icpld.upload.maximum_data_size=2560
f16icpld.upload.speed=57600
f16icpld.upload.disable_flushing=true
f16icpld.upload.use_1200bps_touch=true
f16icpld.upload.wait_for_upload_port=true

f16icpld.bootloader.tool=avrdude
f16icpld.bootloader.low_fuses=0xff
f16icpld.bootloader.high_fuses=0xd8
f16icpld.bootloader.extended_fuses=0xcb
f16icpld.bootloader.file=caterina/Caterina-Leonardo.hex
f16icpld.bootloader.unlock_bits=0x3F
f16icpld.bootloader.lock_bits=0x2F

f16icpld.build.mcu=atmega32u4
f16icpld.build.f_cpu=16000000L
f16icpld.build.vid=0x2341
f16icpld.build.pid=0x9903
f16icpld.build.usb_product="F16 HOTAS Extension LD"
f16icpld.build.board=AVR_LEONARDO
f16icpld.build.core=arduino
f16icpld.build.variant=leonardo
f16icpld.build.extra_flags={build.usb_flags}

##############################################################

leonardoeth.name=Arduino Leonardo ETH
leonardoeth.vid.0=0x2a03
leonardoeth.pid.0=0x0040
leonardoeth.vid.1=0x2a03
leonardoeth.pid.1=0x8040

leonardoeth.upload.tool=avrdude
leonardoeth.upload.protocol=avr109
leonardoeth.upload.maximum_size=28672
leonardoeth.upload.maximum_data_size=2560
leonardoeth.upload.speed=57600
leonardoeth.upload.disable_flushing=true
leonardoeth.upload.use_1200bps_touch=true
leonardoeth.upload.wait_for_upload_port=true

leonardoeth.bootloader.tool=avrdude
leonardoeth.bootloader.low_fuses=0xff
leonardoeth.bootloader.high_fuses=0xd8
leonardoeth.bootloader.extended_fuses=0xcb
leonardoeth.bootloader.file=caterina/Caterina-LeonardoEthernet.hex
leonardoeth.bootloader.unlock_bits=0x3F
leonardoeth.bootloader.lock_bits=0x2F

leonardoeth.build.mcu=atmega32u4
leonardoeth.build.f_cpu=16000000L
leonardoeth.build.vid=0x2a03
leonardoeth.build.pid=0x8040
leonardoeth.build.usb_product="Arduino Leonardo ETH"
leonardoeth.build.board=AVR_LEONARDO_ETH
leonardoeth.build.core=arduino
leonardoeth.build.variant=leonardo
leonardoeth.build.extra_flags={build.usb_flags}

##############################################################

micro.name=Arduino Micro

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037
micro.vid.4=0x2341
micro.pid.4=0x0237
micro.vid.5=0x2341
micro.pid.5=0x8237

micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Arduino Micro"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

